# BoundingBoxUV Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundingBoxUV Members
BoundingBoxUV Class Constructors Methods Properties See Also
---
The BoundingBoxUV type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BoundingBoxUV()()()() | default constructor |
| BoundingBoxUV(Double, Double, Double, Double) | Creates object with supplied values. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the BoundingBoxUV |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Bounds | Indexed access for loops. Use 0 for Min and 1 for Max. |
| IsSet | Indicates whether the BoundingBoxUV is set or not. |
| Max | Maximum coordinates (upper-right corner of the box). |
| Min | Minimum coordinates (lower-left corner of the box). |

# See Also
BoundingBoxUV Class
Autodesk.Revit.DB Namespace